In [1]:
import numpy as np 
import pandas as pd
from pandas import Series,DataFrame

In [2]:
dframe = DataFrame({'k1':['X','X','Y','Y','Z'],
                    'k2':['alpha','beta','aplha','beta','aplha'],
                    'dataset1':np.random.randn(5),
                    'dataset2':np.random.randn(5)})

In [3]:
dframe

  k1     k2  dataset1  dataset2
0  X  alpha -0.328135 -0.855511
1  X   beta -0.072427 -0.535712
2  Y  aplha -0.673046  1.470532
3  Y   beta  0.800791 -0.859171
4  Z  aplha -0.199308 -0.482723

In [4]:
group1 = dframe['dataset1'].groupby(dframe['k1'])

In [5]:
group1

In [6]:
group1.mean()

k1
X   -0.200281
Y    0.063873
Z   -0.199308
Name: dataset1, dtype: float64

In [7]:


cities= np.array(['NY','LA','LA','NY','NY'])
month = np.array(['JAN','FEB','JAN','FEB','JAN'])

In [8]:
dframe['dataset1'].groupby([cities,month]).mean()

LA  FEB   -0.072427
    JAN   -0.673046
NY  FEB    0.800791
    JAN   -0.263722
Name: dataset1, dtype: float64

In [9]:
dframe.groupby('k1').mean()

    dataset1  dataset2
k1
X  -0.200281 -0.695612
Y   0.063873  0.305680
Z  -0.199308 -0.482723

In [12]:
dframe.groupby(['k1','k2']).mean()

          dataset1  dataset2
k1 k2
X  alpha -0.328135 -0.855511
   beta  -0.072427 -0.535712
Y  aplha -0.673046  1.470532
   beta   0.800791 -0.859171
Z  aplha -0.199308 -0.482723

In [13]:
dframe.groupby(['k1']).size()

k1
X    2
Y    2
Z    1
dtype: int64

In [16]:
for name,group in dframe.groupby('k1'):
    print('this is the %s group '%name)
    print(group)
    print ('\n')

this is the X group
  k1     k2  dataset1  dataset2
0  X  alpha -0.328135 -0.855511
1  X   beta -0.072427 -0.535712


this is the Y group
  k1     k2  dataset1  dataset2
2  Y  aplha -0.673046  1.470532
3  Y   beta  0.800791 -0.859171


this is the Z group
  k1     k2  dataset1  dataset2
4  Z  aplha -0.199308 -0.482723

In [17]:
for (k1,k2), group in dframe.groupby(['k1','k2']):
    print('key1 = %s key2 %s' %(k1,k2))
    print(group)
    print('\n')

key1 = X key2 alpha
  k1     k2  dataset1  dataset2
0  X  alpha -0.328135 -0.855511


key1 = X key2 beta
  k1    k2  dataset1  dataset2
1  X  beta -0.072427 -0.535712


key1 = Y key2 aplha
  k1     k2  dataset1  dataset2
2  Y  aplha -0.673046  1.470532


key1 = Y key2 beta
  k1    k2  dataset1  dataset2
3  Y  beta  0.800791 -0.859171


key1 = Z key2 aplha
  k1     k2  dataset1  dataset2
4  Z  aplha -0.199308 -0.482723

In [19]:
group_dict = dict(list(dframe.groupby('k1')))

In [20]:
group_dict['X']

  k1     k2  dataset1  dataset2
0  X  alpha -0.328135 -0.855511
1  X   beta -0.072427 -0.535712

In [21]:
group_dict['Y']

  k1     k2  dataset1  dataset2
2  Y  aplha -0.673046  1.470532
3  Y   beta  0.800791 -0.859171

In [24]:
group_dict = dict(list(dframe.groupby(dframe.dtypes,axis =1)))
# seperating data types by seperating data

In [23]:
group_dict

{dtype('float64'):    dataset1  dataset2
 0 -0.328135 -0.855511
 1 -0.072427 -0.535712
 2 -0.673046  1.470532
 3  0.800791 -0.859171
 4 -0.199308 -0.482723, dtype('O'):   k1     k2
 0  X  alpha
 1  X   beta
 2  Y  aplha
 3  Y   beta
 4  Z  aplha}

In [25]:
dataset2_group = dframe.groupby(['k1','k2'])[['dataset2']]

In [26]:
dataset2_group.mean()

          dataset2
k1 k2
X  alpha -0.855511
   beta  -0.535712
Y  aplha  1.470532
   beta  -0.859171
Z  aplha -0.482723